package logic.oleg;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;

public interface Deskription {
    List<String> deskriptionFalse = Arrays.asList(" Нажаль наш герой повернув не туди \n" +
            "На його шляху почався дуже сильний туман і дощ\n" +
            "Він ще більше зголоднів і замерз\n" +
            "Він блукає по лісу щоб знайти шлях назад \n" +
            "Починає темніти і наш герой всетаки знайшов шлях назад він повернувся до першого місця де прокинувся\n", "Наш герой не здається і шукає вихід з лабіринту\n" +
            "Але він повернув не туди\n" +
            "Він продовжує шукати вихід їду і зброю \n" +
            "Нажаль в нього це не виходить \n" +
            "Він пробує повернутись по старих слідах \n" +
            "І всетаки після довгого блукання він зміг повернутися назад ", "шукаючи зброю і вихід з лабіринту наш герой продовжує шукати вихід \n" +
            "він наткнувся на декілька повороті \n" +
            "І повернув в один з них \n" +
            "Нажаль він повернув не туди і наткнувся на змії але він вчасно їх побачив і почав втікати \n" +
            "по гарячих слідах він всетаки встих вернутися до свого другого привалу", "Наш герой знаву повертає  в надії знайти свій дім\n" +
            "Він ходить по лісі і шукає вихід \n" +
            "Він натикається на племя і дуже радіє тому що думає що йому поможуть \n" +
            "Але на нього нападають люди з племя \n" +
            "Нічого не встигши їм пояснити він кидається втікати назад  і йому це вдяється\n", "Після довгої дороги наш герой змучений шукає вихід\n" +
            "І незамітивши пастки він  він попадає і подає в яму \n" +
            "Проходить ціла ніч наш герой не може  з відти вибратись \n" +
            " І вже попрощавшись з життя  зверху ями йому невідомий кидає шнурок по якому наш герой піднімається на верх \n" +
            "Наляканий він швидко повертається назад\n", "Наш герой продовжує шукати вихід  йдучи по стежці він заходить в глухий кут\n" +
            " Дивно чому стежка нікуди не веде подумав наш герой \n" +
            "І почав вертатись назад \n" +
            "Вертаючись назад на нього нападає злодій який хоче забрати в нього їжу воду \n" +
            "Але так як в нашого героя була зброя він відбився від злодія \n" +
            "Пораниши його він втік\n", "Продовжуючи рухатись наш герой почав швидче шукати вихід з джунглів так як подумав що може наздогнати друзів\n" +
            "В дуже спекотний день в нього закінчилась вода і їжа \n" +
            "але він був настільки радий запискую, що йде в цьому напрямку що він за це не думав\n" +
            "Пройшовши пів дня наш герой зрозумів що дальше іти йому дуже важко і йому потрібно шукати їжу \n" +
            "Здалека він побачив біля дерева мішечок з їжею і водою \n" +
            "Він впевнений був що це пастка і обережно взяв його щоб поїсти пройшло декілька хвилин \n" +
            "Все було тихо, він сів  і почав їсти як тут з різних сторін в нього почали стріляти з луків, \n" +
            "Налякано наш герой важко і довго втікаючи вернувся до хижини\n", "Наш герой нездається і шукає вихід\n" +
            "Йдучи з надією що він туди повернув і  догнати своїх друзів наш герой не здається\n" +
            "проходячи декілька хвилин і на нього нападають дикі кабани \n" +
            "Він починає втікати від них і заліз на дерево \n" +
            "Вони не відходили від дерева і стаяли і чекали на нього \n" +
            " За долю сикунди було чути постріл \n" +
            "Всі кабани розбіглись а один лежав мертвий \n" +
            "Незрозумівши що сталось наш герой стрибнув з дерева і побіг назад ", " Наш герой нерозуміє де він знаходится і чи взагалі він знайде вихід\n" +
            "побачивши вулик він захотів дістати меду \n" +
            " Але на нього напав рій бджолів його пожалили і він втік з відтам 5 Check point false \n", " Герой продовжує шукати вихід \n" +
            "Він блукає по дуже небезпечних глибоких джунглях \n" +
            "Зустрічає дуже багато незрозумілих істот \n" +
            "Але йому щастить тому що його або не замічають або не встигають догнати \n" +
            "Він зупиняється відпочити як бачить що з сторони в яку він йщов виходять дуже великі павуки \n" +
            "І починають бігти за ним \n" +
            "Наш герой починає втікати назад оминаючи всі перешкоди на свому шляху він повертається", "Крок за кроком і наш герой наближається до виходу\n" +
            "Але ні він знову повернув не туди \n" +
            "Виснажиний герой вже немає сил продовжувати рухатись далі\n" +
            "І раптом він почув що в далека йдуть люди \n" +
            "він зразу заховався і слухав про  що вони говорили \n" +
            "На щастя для нашого героя це були вбивці які шукали здобич собі в племя\n" +
            "Коли вони пройшли наш герой зрозумів що вони йдуть зі свого племя тому він потихенько вернувся назад", "\n" +
            "Шукаючи підказки і вихід герой рухається по слідах до водопаду\n" +
            "Коли він прийшов на місце він дуже зрадів і зразу стрибнув у воду\n" +
            "Нічого не підозрюючи через декілька секунд нашого героя почало затягувати в воду наляканий герой почав вибиратись але йому це не вдавалось \n" +
            "Тоді він витягнув ножик вдарив нит те що його тримало і затягувало під воду і виліз на берег \n" +
            "Розвідавши цю тереторію герой зрозумів що він не туди повернув і вернувся назад\n", "З останніх сил наш герой шукає вихід \n" +
            "Йдучи по траві він не замічає пастку в яку попадає , і його піднамає на висоту \n" +
            "Шокований герой розуміє що з хвилини на хвилину  за ним можуть прийти щоб вбити\n" +
            "Він з останніх сил дістає ножик щоб розрізати шнурок і йому це вдається \n" +
            "І він повертається назад\n", "Шукаючи друзів і вихід наш не здається і з останніх сил йде в перід\n" +
            "Раптом він чує розмови, він підійшов блище і заховався, почувши про що говорять люди герой ледве себе стримав щоб ненапасти на цих людей\n" +
            "Коли вони пішли він підійшов до того місця де вони розмовляли і побачив що там є мертвий один з яго друзів \n" +
            "Герой хотів йти за ними і вбити їх але всетаки виріший знайти свою команду і разом напасти на них, і він швидко повернувся назад\n" +
            "\n");

    List<String>deskriptionTrue=Arrays.asList("Наш герой йде по правильному шляху\n" +
            "І повертає саме туди куди йому потрібно \n" +
            " На щастя для ньго він знаходить одяг і їжу\n" +
            "Він лягає поїсти і поспати відпочити щоб набратись сил і рухатись дальше \n" +
            "Після того як наш герой поспав він почав продовжувати свій шлях\n","Наш герой блукає по лісу і виходить на вірну дорогу\n" +
            "він знаходить воду і зброю \n" +
            "Присівши відпочити перед напим героєм зявляються нові повороти \n" +
            "він неможе згадати звідку прийшов тому йде навгад","Починає темніти і нашому героєві потрібно десь переночувати \n" +
            "шукаючи шляї до дому він помічає хижину \n" +
            "Обережно її обійшовши він зрозуміщо вона закинута і там ніхто не живе\n" +
            "Він зайшов в хижину тому що була ніч і побачив там записку \n" +
            "ця записка була від друзів з його племя  в якій було написано що він на правильному шляху\n" +
            "Наш герой переночувавши почав рухатись дальше","Незнаючи куди йти наш герой довго думав куди йому повернути \n" +
            "Добре подивившись він замітив підказку яку вказали йому друзі \n" +
            "Йдучи за нею він знаходить їжу і воду \n" +
            "Йдучи цілу ніч і день наш герой дуже змучився і хотів десь лягти поспати \n" +
            "Нажаль на дворі в джунглях було дуже небезпечно тому що в любий час на нього могли б напасти \n" +
            "але нашому героєві пощастило і він знайшов велику нору \n" +
            "В нього не було виходу  тому що дальше він не міг йти і він ліг спати ","Впевнено наш гурой починає йти далі \n" +
            "Нажаль він не може наздогнати своїх друзів \n" +
            "Але і хороша новина він починає згадувати місцевість \n" +
            "Наш герой дуже зрадів тому що він відчув що знаходиться в декілька кроках від виходу\n","Правильний хід, і наш герой в кроці від виходу\n" +
            "Але він ще цього незнає\n" +
            "він просто блукає по знайомій місцевості \n" +
            "Раптом після довгого блукання наш герой попадає в скверик де знаходяться декілька поворотів \n" +
            "Він не може згадати куди саме йому потрібно йти і він йде навгад","Наш герой вже повністю згадав куди йому потрібно йти тому що він знаходиться вже на своїх землях \n" +
            "Впевнено йдучи до виходу наш герой здалека бачить племя, підбігши блище і впевневшись що це його племя наш герой пішов зустрічати друзі і розказувати пригоди які з ним трапились ");



}
